wisteria-1c/Конфигурация/InformationRegisters/УчетныеЗаписиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УчетныеЗаписиПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ОшибкиПодключенияЭлектроннойПочтыУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиПодключенияЭлектроннойПочтыУНФ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодробноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлектроннойПочты</Name>
			<Comment>АПК:58</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Comment>Имя отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПолучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОставлятьКопииСообщенийНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодХраненияСообщенийНаСервере</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераВходящейПочты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколВходящейПочты</Name>
					<Comment>УНФ поддерживает только IMAP</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверВходящейПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяВходНаСерверПередОтправкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСкрытыеКопииПисемНаЭтотАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУчетнойЗаписи</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЧислоПопытокУзнатьИдентификаторОтправленногоПисьма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриОтправкеПисемТребуетсяАвторизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторизацияСПомощьюПочтовогоСервиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПочтовогоСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/УчетныеЗаписиПользователя/Forms/НастройкаУчетныхЗаписейПользователя/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВывестиБаннеры();
	
	ЗаполнитьСписокУчетныхЗаписей();
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ЭлектроннаяПочтаУНФКлиентСервер.ИмяСобытияУчетнаяЗаписьОбновлена() Тогда
		ОбработатьПодключениеПочтовойСлужбыНаСервере(Параметр);
	ИначеЕсли ИмяСобытия = ЭлектроннаяПочтаУНФКлиентСервер.ИмяСобытияУчетнаяЗаписьЗаписана() Тогда
		ЗаполнитьСписокУчетныхЗаписей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УчетныеЗаписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.Комментарий Тогда
		ОткрытьСписокОшибок();
	ИначеЕсли Поле = Элементы.УчетныеЗаписиСписокВсехОшибок Тогда
		ОткрытьИнструкциюПоИсправлению();
	Иначе
		ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта",
		Новый Структура("Ключ", Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись),
		ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьПочтуПриИзменении(Элемент)
	
	УстановитьПризнакЗагружатьПочту(
	Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись,
	Элементы.УчетныеЗаписи.ТекущиеДанные.ЗагружатьПочту);
	
	Элементы.УчетныеЗаписи.ТекущиеДанные.Комментарий = "";
	
	Оповестить(ЭлектроннаяПочтаУНФКлиентСервер.ИмяСобытияИзмененСоставПодключенныхУчетныхЗаписей(),,
	ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКИнструкции(Команда)
	
	ОткрытьИнструкциюПоИсправлению();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновнуюУчетнуюЗаписьКоманда(Команда)
	
	Если Элементы.УчетныеЗаписи.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.УчетныеЗаписи.ТекущиеДанные.ОсновнаяДляОтправкиПочты = Не Элементы.УчетныеЗаписи.ТекущиеДанные.ОсновнаяДляОтправкиПочты;
	
	Если Не Элементы.УчетныеЗаписи.ТекущиеДанные.ОсновнаяДляОтправкиПочты Тогда
		УстановитьОсновнуюУчетнуюЗапись(ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка"));
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из УчетныеЗаписи Цикл
		Если ТекСтрока.УчетнаяЗапись <> Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись Тогда
			ТекСтрока.ОсновнаяДляОтправкиПочты = Не Элементы.УчетныеЗаписи.ТекущиеДанные.ОсновнаяДляОтправкиПочты
		КонецЕсли;
	КонецЦикла;
	
	УстановитьОсновнуюУчетнуюЗапись(Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьПочтовуюСлужбу(Команда)
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиБаннеры()
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.Сообщение = НСтр("ru = 'Здесь можно подключить свою учетную запись почты (Яндекс.Почта, Mail.ru, Рамблер.Почта и другие)'");
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Подключение первой УЗ почты'");
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.Баннер);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнструкциюПоИсправлению()
	
	ТекущаяУчетнаяЗапись = Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись;
	ТекстОшибки = ПолучитьТекстПоследнейОшибки(ТекущаяУчетнаяЗапись);
	РаботаСПочтовымиСообщениямиКлиент.СообщитьОбОшибкеПодключения(
	ТекущаяУчетнаяЗапись, НСтр("ru = 'Ошибки при подключении учетной записи'"), ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОшибок()
	
	ТекущаяУчетнаяЗапись = Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись;
	ОткрытьФорму(
	"РегистрСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ.ФормаСписка", Новый Структура("УчетнаяЗапись", ТекущаяУчетнаяЗапись));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстПоследнейОшибки(УчетнаяЗапись)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегистрОшибок.ПодробноеПредставлениеОшибки КАК ПодробноеПредставлениеОшибки
	|ИЗ
	|	РегистрСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ КАК РегистрОшибок
	|ГДЕ
	|	РегистрОшибок.УчетнаяЗапись = &УчетнаяЗапись
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистрОшибок.ДатаОшибки УБЫВ";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ПодробноеПредставлениеОшибки;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокУчетныхЗаписей()
	
	УчетныеЗаписи.Загрузить(
	РегистрыСведений.УчетныеЗаписиПользователя.НастройкаПользователя(
	Пользователи.ТекущийПользователь()));
	
	УчетнаяЗаписьДляОтправкиПочты = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяУчетнаяЗаписьЭлектроннойПочты");
	
	Для Каждого ТекУчетнаяЗапись Из УчетныеЗаписи Цикл
		
		Если ТекУчетнаяЗапись.УчетнаяЗапись = УчетнаяЗаписьДляОтправкиПочты Тогда
			ТекУчетнаяЗапись.ОсновнаяДляОтправкиПочты = Истина;
		КонецЕсли;
		
		ОтобразитьКомментарий(ТекУчетнаяЗапись)
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьКомментарий(ТекУчетнаяЗапись)
	
	КоличествоОшибокПодключения = РегистрыСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ.КоличествоОшибокПодключения(ТекУчетнаяЗапись.УчетнаяЗапись);
	Если Не ЗначениеЗаполнено(КоличествоОшибокПодключения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекУчетнаяЗапись.ЗагружатьПочту Тогда
		
		ФорматнаяСтрокаСклонения = ";%1 ошибка подключения;;%1 ошибки  подключения;%1 ошибок подключения;%1 ошибки  подключения";
		ТекУчетнаяЗапись.Комментарий = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ФорматнаяСтрокаСклонения, КоличествоОшибокПодключения);
		ТекУчетнаяЗапись.СписокВсехОшибок = НСтр("ru = 'Инструкция по устранению'");
		
	Иначе
		
		ТекУчетнаяЗапись.Комментарий = НСтр("ru = 'Отключена из-за множественных ошибок'");
		
	КонецЕсли;
	
	Элементы.Комментарий.Видимость = Истина;
	Элементы.УчетныеЗаписиСписокВсехОшибок.Видимость = Истина;
	Элементы.УчетныеЗаписиПерейтиКИнструкции.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.УчетныеЗаписи.ТолькоПросмотр = Не ПравоДоступа("Редактирование",
	Метаданные.РегистрыСведений.УчетныеЗаписиПользователя);
	
	Элементы.УчетныеЗаписиПодключитьПочтовуюСлужбу.Доступность = ПравоДоступа("Добавление",
	Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты);
	
	Элементы.Баннер.Видимость = (УчетныеЗаписи.Количество() = 0);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПризнакЗагружатьПочту(Знач УчетнаяЗапись, Знач ЗагружатьПочту)
	
	РегистрыСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ.ОчиститьЗарегистрированныеОшибки(
	УчетнаяЗапись);
	
	РегистрыСведений.УчетныеЗаписиПользователя.УстановитьПризнакЗагружатьПочту(
	Пользователи.ТекущийПользователь(),
	УчетнаяЗапись,
	ЗагружатьПочту);
	
	Если ЗагружатьПочту Тогда
		УстановитьПризнакИспользоватьДляПолучения(УчетнаяЗапись);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПризнакИспользоватьДляПолучения(Знач УчетнаяЗапись)
	
	УстановитьПривилегированныйРежим(Истина);
	
	УчетнаяЗаписьОбъект = УчетнаяЗапись.ПолучитьОбъект();
	Если УчетнаяЗаписьОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьОбъект.ИспользоватьДляПолучения = Истина;
	УчетнаяЗаписьОбъект.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОсновнуюУчетнуюЗапись(УчетнаяЗапись)
	
	ПерсональныеНастройкиРУНФ.Установить(
	УчетнаяЗапись, 
	"ОсновнаяУчетнаяЗаписьЭлектроннойПочты",
	Пользователи.ТекущийПользователь());
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ИспользоватьДляОтправки") Тогда
		УчетнаяЗаписьОбъект = УчетнаяЗапись.ПолучитьОбъект();
		УчетнаяЗаписьОбъект.ИспользоватьДляОтправки = Истина;
		УчетнаяЗаписьОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодключениеПочтовойСлужбыНаСервере(Знач УчетнаяЗапись)
	
	УстановитьПризнакЗагружатьПочту(УчетнаяЗапись, Истина);
	
	ЗаполнитьСписокУчетныхЗаписей();
	
	НайденныеСтроки = УчетныеЗаписи.НайтиСтроки(Новый Структура("УчетнаяЗапись", УчетнаяЗапись));
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Элементы.УчетныеЗаписи.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
